Repository: Geoalert/mapflow-docs-en
Catalog: source/locale/*/LC_MESSAGES/um/classes.po
Languages: ru

source: Urban Mapping classes
ru: Классы Urban Mapping

source: Reference
ru: Справка

source: CLASS_ID
ru: ID_КЛАССА

source: CLASS NAME
ru: ИМЯ КЛАССА

source: DESCRIPTION
ru: ОПИСАНИЕ

source: OSM refereral tag
ru: Ссылочный тег OSM

source: Apartment building
ru: Многоэтажное здание

source: Roof footprints of the multistorey apartment buildings
ru: Отпечатки крыш многоэтажных жилых домов

source: House
ru: Дом

source: Mostly private houses (usually represents a single household)
ru: В основном частные дома (обычно представляет собой одно домашнее хозяйство)

source: Industrial building
ru: Промышленное здание

source: Mostly industrial (Plants, large hangars, warehouses, etc.)
ru: В основном промышленные (заводы, большие ангары, склады и т.д.)

source: Commercial building
ru: Коммерческое здание

source: Offices, retail, etc.
ru: Офисы, розничная торговля и т.д.

source: Other non-residential buildings
ru: Другие нежилые здания

source: Garages, transformer boxes, small hangars, etc.
ru: Гаражи, трансформаторные будки, небольшие ангары и т.д.

source: Urban Mapping visualization with ArcGIS Online, Carto, and EverGIS online
ru: Визуализация Urban Mapping с помощью ArcGIS Online, Carto и EverGIS online

source: Mapflow Web easily processes imagery and extracts vector objects that can be downloaded in **GeoJSON** format. We recommend using GeoJSON since it is a de-facto standard in web mapping. It is natively supported by web mapping frameworks (e.g. Leaflet or Mapbox) and GIS software like QGIS or the ArcGIS Suite.
ru: Mapflow Web легко обрабатывает изображения и извлекает векторные объекты, которые можно загрузить в формате **GeoJSON**. Мы рекомендуем использовать GeoJSON, поскольку это стандарт де-факто в веб-картографии. Он изначально поддерживается веб-картографическими фреймворками (например, Leaflet или Mapbox) и ГИС-программным обеспечением, таким как QGIS или пакетом ArcGIS.

source: GeoJSON is an open standard format designed for representing simple geographical features, along with their non-spatial attributes. It is based on the JSON format. The features include points, linestrings (Mapflow roads), polygons (Mapflow buildings footprints, forest and field masks), or multi-part collections of these types. Mapflow allows different options for actions with processing results stored in GeoJSON. You are able to download or “Open with **geojson.io**”.
ru: GeoJSON - это открытый стандартный формат, предназначенный для представления простых географических объектов вместе с их непространственными атрибутами. Он основан на формате JSON. К объектам относятся точки, полилинии (модель дороги Mapflow), полигоны (контуры зданий Mapflow, маски лесов и полей) или коллекции из нескольких частей этих типов. Mapflow предоставляет различные варианты действий с результатами обработки, хранящимися в GeoJSON. Вы можете загрузить или “Открыть с помощью **geojson.io**”.

source: Interaction panel
ru: Панель взаимодействия

source: Open with geojson.io
ru: Открыть в geojson.io

source: `Geojson.io <https://geojson.io>`_ allows you to view and save the results in a different format (CSV, KML, TopoJSON, WKT, Shapefile). Click “Save” and select the format in the menu bar.
ru: `Geojson.io <https://geojson.io>`_ позволяет вам просматривать и сохранять результаты в разных форматах (CSV, KML, TopoJSON, WKT, Shapefile). Нажмите “Сохранить” и выберите формат в панели меню.

source: Using GeoJSON allows you to use only drag&drop to visualize Mapflow output results in numerous Web-GIS without converting data formats. `See this video <https://youtu.be/ZG5fVut87ZQ>`_ about how to upload and style a building classification results with ArcGIS online, Carto, and Evergis online.
ru: Использование GeoJSON позволяет вам использовать только drag&drop для визуализации выходных результатов Mapflow в многочисленных веб-ГИС без преобразования форматов данных. `Смотрите это видео <https://youtu.be/ZG5fVut87ZQ>`_ о том, как загружать и оформлять результаты классификации зданий с помощью ArcGIS online, Carto и Evergis online.

source: Urban Mapping classes in ArcGIS online
ru: Классы Urban Mapping в ArcGIS online

source: Urban Mapping classes in Carto
ru: Классы Urban Mapping в Carto

source: Urban Mapping classes in Evergis Online
ru: Классы Urban Mapping в Evergis Online
