Repository: Geoalert/mapflow-docs-en
Catalog: source/locale/*/LC_MESSAGES/forest/classes.po
Languages: ru

source: Forest Mapping classes
ru: Классы Лесного Картографирования

source: Here is presented a list of classes for the Forest vegetation Mapping Model. There are two options for forest semantic classification:
ru: Здесь представлен список классов для Модели Картографирования Лесной растительности. Существует два варианта семантической классификации лесов:

source: Classification by heights – classification of the areas of vegetation and shrub vegetation by height classes according to the specified thresholds: 0-4 m, 4-10 m, 10+ m. Forest areas of each height class are polygonized in separate features, the height class is indicated in its properties. Heights thresholds are customizable values in the processing pipeline.
ru: Классификация по высотам – классификация участков растительности и кустарниковой растительности по классам высоты в соответствии с указанными пороговыми значениями: 0-4 м, 4-10 м, 10+ м. Лесные массивы каждого класса высот полигонизируются в виде отдельных объектов, класс высот указывается в его свойствах. Пороговые значения высот - это настраиваемые значения в пайплайне обработки.

source: Classification by overgrowth density – classification of the area of vegetation and shrub vegetation into classes according to the density and height: high forest, low (growing) forest, open woodland, and shrub.
ru: Классификация по плотности зарослей – классификация площади растительности и кустарниковой растительности на классы в зависимости от плотности и высоты: высокий лес, низкорослый (растущий) лес, открытые лесные массивы и кустарник.

source: CLASS_ID
ru: ID_КЛАССА

source: DENSITY
ru: ПЛОТНОСТЬ

source: Description
ru: Описание

source: low vegetation
ru: низкая растительность

source: dense/sparse
ru: плотный/разреженный

source: medium forest
ru: средний лес

source: high forest
ru: высокий лес
