Repository: Geoalert/mapflow-docs-en
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Welcome
ru: Добро пожаловать

source: We are happy that you are interested in Earth Observation Data analysis and Mapping! The Earth Observation to Mapping process is going through the following main stages:
ru: Мы рады, что вам интересен анализ данных дистанционного зондирования Земли (ДЗЗ) и применение их в своей работе. Значит нам по пути. «Спутниковые снимки» - это данные, полученные с космических аппаратов дистанционного зондирования. Картография и пространственный анализ базируются на трех основных стадиях обработки данных:

source: EO data access (e.g. satellite or aerial imagery)
ru: Доступ к данным (например спутниковая или аэрофотосъемка)

source: EO data processing and analysis – here `Mapflow <https://mapflow.ai>`_ comes in game |:boom:|
ru: Автоматический препроцессинг и анализ – здесь вступает в игру `Mapflow <https://mapflow.ai/ru>`_ |:boom:|

source: GIS – check and edit results to use them in you application
ru: Работа в ГИС – проверка автоматических результатов и подготовка их для дальнейшей работы

source: Mapflow is powered by the engine that operates data processing pipelines (we call "flows"). Using Mapflow you run your flows getting all power of semnatic imagery analysis.
ru: Платформа Mapflow управляет цепочками обработки данных, которые вы запускаете, помогая пользователю на всех стадиях обработки. Но главное - наличие встроенных алгоритмов семантического анализа, которые позволяют выделять множество семантически связанных объектов и преобразовывать их в векторные геоданные.

source: Getting Started with Mapflow
ru: Mapflow – начало работы

source: Mapflow AI models
ru: Модели ИИ

source: Use with GIS...
ru: Использование в ГИС...

source: User guides
ru: Обучающие материалы

source: Reference materials
ru: Справочные материалы

source: Frequently asked questions
ru: Часто задаваемые вопросы

source: :download:`Mapflow User Guides <userguides/_static/_downloads/user_guides.pdf>`
ru: :download:`Mapflow Обучающие материалы <userguides/_static/_downloads/user_guides.pdf>`

source: :download:`Mapflow AI-Mapping models <userguides/_static/_downloads/pipelines.pdf>`
ru: :download:`Mapflow Модели ИИ <userguides/_static/_downloads/pipelines.pdf>`

source: This documentation is distributed under the terms of Creative Commons License **"Attribution-NoDerivs" СC BY-ND**
ru: Эта документация распространяется под открытой лицензией Creative Commons License **"Attribution-NoDerivs" СC BY-ND**
