Repository: Geoalert/mapflow-docs-en
Catalog: source/locale/*/LC_MESSAGES/userguides/requirements.po
Languages: ru

source: Requirements for using the platform
ru: Требования к использованию платформы

source: Upload GeoTIFF requirements
ru: Требования к загрузке GeoTIFF

source: Please pay attention to the following:
ru: Пожалуйста, обратите внимание на следующее:

source: Images you upload are preprocessed in `Uint8` format. If your image is not of this type and you want to preview it manually bafore uploading to the Mapflow server, please use our `image preprocessing script <https://github.com/Geoalert/mapflow_data_preprocessor/>`_ or other tools to translate it to the appropriate format;
ru: Загружаемые вами изображения предварительно обрабатываются в формате `Uint8`. Если ваше изображение не относится к этому типу и вы хотите просмотреть его вручную перед загрузкой на сервер Mapflow, пожалуйста, воспользуйтесь нашим `скриптом предварительной обработки изображений <https://github.com/Geoalert/mapflow_data_preprocessor/>`_ или другими инструментами для перевода его в соответствующий формат;

source: Your imagery must be georeferenced in geographic or projected coordinate system, ellipsoid WGS84, it is recommended to use UTM or Web Mercator;
ru: Ваши изображения должны быть привязаны к географической или проекционной системе координат, эллипсоиду WGS84, рекомендуется использовать UTM или Web Mercator;

source: Your image is supposed to be RGB composite, RGBa and Singleband will work as well*;
ru: Предполагается, что ваше изображение должно быть составным RGB, также будут работать RGBa и одноканальное*;

source: Each Mapflow model has its recommendations for the spatial resolution of the input data, see :ref:`Model requirements` below
ru: Каждая модель Mapflow имеет свои рекомендации по пространственному разрешению входных данных, смотрите :ref:`Model requirements` ниже

source: In case of non-compliance with any requirements, the system reports an error. If you are using Mapflow Web or Mapflow QGIS plugin, the error messages are shown in the user interface. For more details, see :doc:`errors description <../api/error_messages>`.
ru: В случае несоблюдения каких-либо требований система сообщает об ошибке. Если вы используете Mapflow Web или плагин Mapflow QGIS, сообщения об ошибках отображаются в пользовательском интерфейсе. Для получения дополнительной информации смотрите :doc:`сообщения об ошибках <../api/error_messages>`.

source: Model requirements
ru: Требования моделей

source: The table below lists model requirements for spatial resolution of the input imagery.
ru: В таблице ниже перечислены требования модели к пространственному разрешению входных изображений.

source: **"Required"** means that the imagery with resolution outside of this range will be rejected from processing and the request will fail.
ru: **"Требуемый"** означает, что изображения с разрешением за пределами этого диапазона будут отклонены от обработки и запрос завершится неудачей.

source: **"Recommended"** means that the model is fit specifically for this spatial resolution. Any images of higher resolution will be downsampled before processing, so it gives no profit to upload higher resolution. Images of lower resolution (if meeting the "required" section) will be upsampled, but the results will not be so good as for recommended resolution.
ru: **"Рекомендуемый"** означает, что модель подходит именно для этого пространственного разрешения. Любые изображения с более высоким разрешением будут уменьшены перед обработкой, поэтому загрузка изображений с более высоким разрешением не приносит никакой пользы. Изображения с более низким разрешением (если они соответствуют разделу «требуемый») будут подвергнуты дополнительной выборке, но результаты будут не такими хорошими, как при рекомендуемом разрешении.

source: GSD is specified in `UTM coordinate system <https://proj4.org/en/9.2/operations/projections/utm.html>`_, and may not correspond to what you see as "pixel size" if your image's coordinate system differs.
ru: GSD указан в `системе координат UTM <https://proj4.org/en/9.2/operations/projections/utm.html>`_ и может не соответствовать тому, что вы видите как «размер пикселя», если система координат вашего изображения отличается.

source: `Learn more <https://wiki.openstreetmap.org/wiki/Zoom_levels>`_ about zoom and spatial resolution of imagery basemaps.
ru: `Узнайте больше <https://wiki.openstreetmap.org/wiki/Zoom_levels>`_ о зуме и пространственном разрешении базовых карт изображений.

source: Model
ru: Модель

source: Description
ru: Описание

source: Recommended zoom
ru: Рекомендуемый зум

source: Recommended GSD m/px
ru: Рекомендуемый GSD, м/пиксель

source: Required zoom range
ru: Требуемый диапазон зума

source: Required GSD range, m/px
ru: Требуемый GSD, м/пиксель

source: Buildings
ru: Здания

source: Extract roof contours, with optional classification, simplification and height estimation
ru: Извлекает контуры крыши с опциональными классификацией, полигонизацией и оценкой высоты

source: High-density housing [Mapflow Web only]
ru: Плотная застройка [только в Mapflow Web]

source: Extraction and instance detection of the building roofprints in the areas of high density housing
ru: Извлекает и детектирует отпечатки крыш зданий в районах с высокой плотностью застройки

source: Buildings (Aerial imagery)
ru: Здания (Аэрофото)

source: Extract roof contours (roofprints) from very high-resolution aerial imagery
ru: Извлекает контуры крыш (отпечатков крыши) из аэрофотоснимков с очень высоким разрешением

source: Forest
ru: Лес

source: Extract segmentation masks of forested areas from high-resolution RGB images
ru: Извлекает маски сегментации лесных массивов из изображений RGB с высоким разрешением

source: Forest with heights [Mapflow API/QGIS only]
ru: Лес с высотами

source: Extract segmentation masks of forested areas from high-resolution RGB images with separation by height classes
ru: Извлечение масок сегментации лесных массивов из изображений RGB высокого разрешения с разделением по классам высоты

source: Roads
ru: Дороги

source: Extract road mask from high-resolution satellite imagery
ru: Извлекает дорожную маску из спутниковых снимков высокого разрешения

source: Constructions
ru: Строительство

source: The model highlights areas in the satellite image that contain construction sites and buildings under construction
ru: Модель выделяет области на спутниковом снимке, которые содержат строительные площадки и строящиеся здания

source: Agriculture fields
ru: С/Х поля

source: Extraction and instance separation of agriculture fileds from high-resolution satellite imagery
ru: Извлекает и разделяет сельскохозяйственные поля из спутниковых снимков высокого разрешения

source: \* Mapflow.ai can also process single-band (panchromatic) imagery, but the NN models are not tuned for such kind of data, so the quality of the result may be worse than expected.
ru: \* Mapflow.ai также может обрабатывать одноканальные (панхроматические) изображения, но ИИ модели не настроены для такого рода данных, поэтому качество результата может быть хуже ожидаемого.
