Repository: Geoalert/mapflow-docs-en
Catalog: source/locale/*/LC_MESSAGES/userguides/team_accounts.po
Languages: ru

source: Team accounts
ru: Командные аккаунты

source: Users can run a Team account to invite collaborators, share projects and manage Mapflow limits. Currently, you need to reach out to us to create a Team while we are working on a public UI. Contact us by help@geoalert.io using your corporate email linked to Mapflow account. Once the Team is created the Owner can invite new members, and assign and manage their limits. Only the Owner gets access to the Team profile.
ru: Пользователи могут создать командную учетную запись, чтобы приглашать сотрудников, делиться проектами и управлять лимитами Mapflow. В настоящее время вам необходимо связаться с нами, чтобы создать команду, пока мы работаем над общедоступным пользовательским интерфейсом. Свяжитесь с нами по адресу help@geoalert.io используя свой корпоративный адрес электронной почты, привязанный к учетной записи Mapflow. Как только Команда создана, Владелец может приглашать новых участников, назначать лимиты и управлять ими. Только Владелец получает доступ к профилю Команды.

source: The Team creation is currently not enabled for all users – so contact our support to set up a Team.
ru: В настоящее время функция создания Команды доступна не для всех пользователей, поэтому для создания команды обратитесь в нашу службу поддержки.

source: If the Team member's email is already registered as a Mapflow account, reach out to Support (help@geoalert.io) to ask to link the account.
ru: Если адрес электронной почты члена команды уже зарегистрирован в аккаунта Mapflow, обратитесь в службу поддержки (help@geoalert.io) и попросите привязать учетную запись.

source: Project sharing in the Team
ru: Предоставление доступа к проекту в Команде

source: You can share your project with anyone in the Team and assign his role as needed. Go to *Project -- Share* and invite your specific coworkers or / and activate the option "Anyone in the team".
ru: Вы можете поделиться своим проектом с любым членом команды и назначить ему роль по мере необходимости. Пройдите в *Проект -- Поделиться* и пригласите своих конкретных коллег или / и активируйте опцию "Для всех в команде".

source: There are four types of the project user's role:
ru: Существует четыре типа роли пользователя проекта:

source: readonly - can view the project history and the results
ru: readonly - может просматривать историю проекта и результаты

source: contributor – can run the workflows in the project
ru: contributor – может запускать обработки в проектах

source: maintainer – can run and edit the workflows, and share projects with users (up to maintainer role)
ru: maintainer – может запускать и редактировать обработки, а также делиться проектом с пользователями (вплоть до роли maintainer)

source: owner – full rights to edit all roles in the project
ru: owner - полный контроль над проектами

source: Your collaborators will see the new shared projects in their dashboard and use them according to the role assigned.
ru: Ваши сотрудники увидят новые проекты, которыми вы поделились, на своей панели мониторинга и будут использовать их в соответствии с назначенной ролью.

source: You can share your project with the non-team users for the view-only access. Go to the Project -- Share and enter the Mapflow user's email.
ru: Вы можете предоставить доступ к своему проекту пользователям, не входящим в команду, но только для просмотра. Перейдите в раздел Проект - Поделиться и введите адрес электронной почты пользователя Mapflow.
